myWorkerDict = {
    "Сотрудник 1":
        {
            "ФИО": "Адилет Эшмаматов",
            "Возраст": 28,
            "Род деятельности": "Работник цеха",
            "Заработная плата": 25000,
            "ФИО Супруга/и": "Гульзада Саратова",
            "Дети": {
                "Ребенок 1": "Мухаммад Эшмаматов",
                "Ребенок 2": "Элиза Эшмаматова"
            },
            "Транспорт": "Тойота Камри 35",
            "Адрес проживания": "г. Бишкек, ул. Лев Толстой 77"
        },
    "Сотрудник 2":
        {
            "ФИО": "Эсен Урматов",
            "Возраст": 30,
            "Род деятельности": "Работник цеха",
            "Заработная плата": 31000,
            "ФИО Супруга/и": "Тамара Тиленова",
            "Дети": {
                "Ребенок 1": "Усон Урматов",
            },
            "Транспорт": "Хонда Фит",
            "Адрес проживания": "г. Бишкек, ул. Чуй 123"
        },
    "Сотрудник 3":
        {
            "ФИО": "Аселя Давлетова",
            "Возраст": 30,
            "Род деятельности": "Работник бухгалтерии",
            "Заработная плата": 42000,
            "ФИО Супруга/и": "Сергей Васильев",
            "Дети": {
                "Ребенок 1": "Елена Васильева",
                "Ребенок 2": "Степан Васильев",
                "Ребенок 3": "Марат Васильев",
            },
            "Транспорт": "Хонда Одиссей",
            "Адрес проживания": "г. Бишкек, ул. Токтогула 76"
        },
    "Сотрудник 4":
        {
            "ФИО": "Мария Степанова",
            "Возраст": 29,
            "Род деятельности": "Работник маркетинга",
            "Заработная плата": 35000,
            "ФИО Супруга/и": "Олег Кичин",
            "Дети": {
                "Ребенок 1": "Василиса Кичина",
            },
            "Транспорт": "Пешком",
            "Адрес проживания": "г. Бишкек, мкр 7 дом 76, кв: 14"
        },
    "Сотрудник 5":
        {
            "ФИО": "Олег Иванов",
            "Возраст": 45,
            "Род деятельности": "Генеральный Директор",
            "Заработная плата": 70000,
            "ФИО Супруга/и": "Светлана Валерьева",
            "Дети": {
                "Ребенок 1": "Григорий Иванов",
                "Ребенок 2": "Наталья Иванова",
                "Ребенок 3": "Василий Иванов",
                "Ребенок 4": "Филип Иванов",
            },
            "Транспорт": "БМВ X7",
            "Адрес проживания": "г. Бишкек, мкр 5 дом 16, кв: 102"
        },
}

print(f'Программа должна иметь в себе следующее меню:'
      f' Здравствуйте, дорогой Пользователь!'
      f' \nНаберите определенную цифру из данного меню,чтобы получить доступ к нужному Вам функционалу!'
      f'\n1 - Поиск сотрудника'
      f'\n2 - Добавление нового сотрудника'
      f'\n3 - Удаление сотрудника'
      f'\n4 - Составить список для награждения сотрудников'
      f'\n5 - Составить список сотрудников на отпуск'
      f'\n6 - Повышение З-П'
      f'\n7 - Понижение З-П'
      f'\n8 - Отобразить имя сотрудника, получающий максимальную З-П'
      f'\n9 - Отобразить имя сотрудника, получающий минимальную З-П'
      f'\n10 - Подсчет среднемесячной Заработной платы'
      f'\n11 - Вывод суммарной З-П всех сотрудников'
      f'\n12 - Виды транспорта всех сотрудников'
      f'\n13 - Отобразить имена и кол-во детей всех сотрудников'
      f'\n0 - Выход из Программы')

menuCommand = input('Введите команду: ')
'''
cars = set()
 for key in myWorkerDict.keys():
  if myWorkerDict[key]["Транспорт"] == "Пешком":
   pass
  else:
   cars.add(myWorkerDict[key]["Транспорт"])
   '''

if menuCommand == '12':
    cars = [myWorkerDict[key]["Транспорт"] for key in myWorkerDict.keys() if myWorkerDict[key]["Транспорт"] != "Пешком"]
    print(cars)



