"""
Задача 1
Примите от пользователя любой текст или слово и отобразите ее в обратном
направлении
Пример вывода на консоль:
Введите слово или текст: Привет!
Результат: !тевирП
"""
userText = input('Напишите любое слово: ')
print(userText[:: -1])

"""
Pадача 2:
Есть следующий текст:
«Я обучаюсь курсу Python Django»
Необходимо отобразить на консоли название курса с помощью среза
Пример вывода на консоль:
Название курса: Python Django"""

text = 'Я обучаюсь курсу Python Django'
print (text[17:])


"""
Задача 3:
Есть следующие слова:
$$$Python@@@
%%%Programming
City&&&
****Computer***
Необходимо убрать лишние знаки как спереди, сзади, так и со всех сторон
Пример вывода на консоль:
Python
Programming
City
Computer
"""
word1 = '$$$Python@@@'
word2 = '%%%Programming'
word3 = 'City&&&'
word4 = '****Computer***'
word1 = word1.strip('$')

print(word1.strip('$').strip('@'))
print(word2.strip('%'))
print(word3.strip('&'))
print(word4.strip('*'))

"""
Задача 4

Примите от пользователя информацию о человеке, конкретно:
- Любимое число
- Любимый цвет
- Любимый город
- Любимая еда
Отобразите 2-мя методами: 
С помощью метода format и с помощью метода f-строк

"""

favNumber = input('Напишите любимое число: ')
favColour = input('Напишите любимый цвет: ')
favCity = input('Напишите любимый город: ')
favFood = input('Напишите любимое блюдо: ')

print(f"Мое любимое число - {favNumber}, любимый цвет - {favColour}, любимый город - {favCity.capitalize()}, а любимое блюдо - {favFood}") #метод Fomat
print(f"Мое любимое число - ", favNumber, " любимый цвет - ", favColour, " любимый город - ", favCity.capitalize(), " а любимое блюдо - ", favFood) #метод f-сторки



