# Задача 1. Убрать 10, 20, 30 из заданного множества за один раз
set1 = {10, 20, 30, 40, 50}
set2 = {10, 20, 30}
print(set1.difference(set2))

#Задача 2. Определить, имеют ли следующие два набора множеств какие-либо общие элементы. Если да отобразите общие элементы
set1 = {10, 20, 30, 40, 50}
set2 = {60, 70, 80, 90, 10}
commonElement = set1.intersection(set2)
for i in commonElement:
    print(f' Два множества имеют общий элемент и это: {i}')


# Задача 3. Необходимо убрать из множества 1, который не повторяются во множестве 2:
set1 = {10, 20, 30, 40, 50}
set2 = {30, 40, 50, 60, 70}
print(set2 - set2.difference(set1))

#Задача 4.
'''Создайте множество состоящее из 5 элементов.
Выполните такие операции как:
 • удалите элемент со значением 67
 • добавьте два новых элемента
 • выведите множество на экран'''
mySet = {11, 'Omsk', 67, 14, 'a'}
mySet.discard(67)
mySet.update({10, 'Vasya'})
print(mySet)







