# Задача 1
'''Скопировать элемент 44 и 55 из текущего кортежа в новый кортеж
tuple1 = (11, 22, 33, 44, 55, 66'''
import copy

tuple1 = (11, 22, 33, 44, 55, 66)
tuple2 = copy.copy(tuple1[3:5])
print(tuple2)

# Задача 2
'''
Создайте кортеж из имен людей. Выведите все имена через цикл for 
по шаблону: "Привет, [ИМЯ]"
'''
namesTuple = ('Коля', 'Саша', 'Ирина', 'Даша')
for name in namesTuple:
    print(f'Привет, {name}!')

#Задача 3 Вывести заданный кортеж в обратном порядке:
aTuple = (10, 20, 30, 40, 50)

print(aTuple[::-1])

#Задача 4  Распаковать нижеследующий кортеж по параметрам :
aTuple = (10, 20, 30, 40, 50)
(a, b, c, d, e) = aTuple
print(a)
print(b)
print(c)
print(d)
print(e)