'''
 Примите имя человека от пользователя, затем сгенерируйте
имя этого человека 10 раз в новом списке.
'''
userName = input('Введите свое имя: ')
generatedList = [user*3 for user in range(10)]
print(generatedList)

'''Задача 2
 Есть следующий список [18,43,9,65,12,65,24,6]. Необходимо 
все числа из этого списка, поделить на 3 и вывести новый
список:'''
numberList = [18, 43, 9, 65, 12, 65, 24, 6]

numberList = [number / 3 for number in numberList]
print(numberList)

'''Задача 3'''
newList = [number for number in numberList if number % 3 == 0]
print(newList)

'''Задача 4
Примите от пользователя название 5 городов и проверьте
совпадает ли хотя бы одна из них со следующим городом 
“Tokyo”, если совпадает то в новом списке должно быть 
«совпадает» иначе «не совпадает»?'''


cityList = [input('Введите город: ') for city in range(4)] #запускает цмкл где элементам списка из range 0-4 присваиваются значения imput
cityList = ['Совпадает' if city == 'Tokyo' else 'Не совпадает' for city in cityList] #запускает цмкл где элементы проверяются на наличие совпадений
print(cityList)


''' Задача 5
Принимаем число от пользователя и нам нужно каждое число умножить 
на 3 и добавить к этому числу пользователя каждый элемент в промежутке до 10
и сгенерировать новый список исходя от этого условия

Пример: Пользователь пишет число 10 * 3 + 1
10 * 3 +2 
10 * 3 + 3'''
userNumber = int(input('Введите число: '))
userNumbers = [number + userNumber * 3 for number in range(10)]
print(userNumbers)