'''Задача 1
Создать функцию, которая принимает в себя в качестве параметра трехзначное
число, а затем выводит их в обратном порядке'''


def reverseNumber(number):
    number = str(number) #Коневертирую int в строку т.е. в список
    return int(number[::-1])  #Возвращаю перевернутый список и конвертирую обратно в int
print(type(reverseNumber(123)))


'''Задача 2
Создать функцию, которая принимает в качестве параметра неопределенное
количество параметров, а затем находит среднее их значение'''


def avgFunc(*params):
   return print(sum(params)/len(params))

avgFunc(5,5,5,9)

'''Задача 3
 Напишите функцию Python, которая принимает список и возвращает новый
список с уникальными элементами переданного в качестве параметра списка.'''

def uniqueList(*list): #Принимаем неограниченное количество аргументов
    list = set(list) #Конверируем в множество, чтобы исключить повторы
    return list

print(uniqueList(1,2, 3, 'Вася', 'Вася', 1, 16))

'''Задача 4
Создать функцию, которая принимает в себя в качестве параметра три целых
числа, функция должна вывести количество положительных и количество
отрицательных чисел.'''


def countNumbers(num1, num2, num3):
    positive = 0
    if num1 > 0:
       positive +=1
    elif num2 > 0:
       positive +=1
    elif num3 > 0:
       positive += 1
    negative = 3 - positive
    return print(f' Отрицательных значений {negative}, Положительных {positive}')
print(countNumbers(1, -2, -3))


